{"data":{"markdownRemark":{"html":"<h1>Table of Contents</h1>\n<p>  <a href=\"#General%20Tips\">General Tips</a></p>\n<p>  <a href=\"#Advice\">Advice</a></p>\n<pre><code>[Planning](#Planning)\n\n[Opening/Closing Ceremony](#Opening/Closing Ceremony)\n\n[Signage](#Signage)\n\n[Devpost](#Devpost)\n\n[User Experience](#User Experience)\n\n[Communication](#Communication)\n\n[Judging](#Judging)\n\n[Prize Categories](#Prize Categories)\n\n[Social Media](#Social Media)\n</code></pre>\n<p>  <a href=\"#Additional%20Resources\">Additional Resources</a></p>\n<p>  <a href=\"#API%20Quick%20Links/Troubleshooting\">API Quick Links/Troubleshooting</a>  </p>\n<pre><code>[MLH Specific APIs](#MLH Specific APIs)\n\n[General Resources for Popular Subjects](#General Resources for Popular Subjects)\n</code></pre>\n<h1>General Tips</h1>\n<p><strong>Be Proactive</strong></p>\n<ul>\n<li>\n<p>Proactivity (the check to Murphy’s Law) - Anything that can be confirmed should be confirmed</p>\n</li>\n<li>\n<p>Always be considering what could go wrong with the next big task of the day, whether that is a meal, a workshop, judging, etc. Have contingency plan for what you and your team can do if something goes wrong.  Try to have such a plan that when something does comes up, it’s not a crisis, it’s actually still part of the plan, just a sub-optimal plan B, C, …</p>\n<ol>\n<li>Food: Call food caterers a day in advance, and then again 2+ hours before the intended delivery time to confirm that everything is still going to be on time and meet specified quantity</li>\n<li>\n<p>Volunteers:  </p>\n<ul>\n<li>\n<p>Reserve one member of your organizer team to be the designated point of contact for volunteers: they should know (or have that information on hand at all times)</p>\n<ul>\n<li>All the volunteers in the building at any given time, what their responsibilities are, etc.</li>\n</ul>\n</li>\n<li>\n<p>Prepare physical packets (they can be generalized, don’t need to be volunteer-specific) for volunteers that contain:</p>\n<ul>\n<li>The responsibilities,</li>\n<li>The rules of the event,</li>\n<li>Map of the venue,</li>\n<li>Time table so they know when/where they’re supposed to be and who is going to replace them</li>\n<li>Contact information for all relevant parties: Lead Organizer, Designated PoC for volunteer organizer,  Adult Moderator, custodian/venue staff (if there’s a chance that people get locked out of certain parts of the venue)</li>\n<li>Etc. anything that would likely come up that they would otherwise have to find an organizer to figure out</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Participants:</p>\n<ul>\n<li>\n<p>Have a <em>concise</em> and visually appealing FAQ/info packet (git repo, google doc, sub-page on website, make it as accessible as possible because hackers <u>will not</u> use it if it’s not insanely easy to get to and easy to navigate) that contains:</p>\n<ul>\n<li>Schedule,</li>\n<li>Map with locations for Workshops, meals, mini-events, etc.</li>\n<li>\n<p>Important FAQ  </p>\n<ul>\n<li>Prize categories and details for eligibility</li>\n<li>How to submit to Devpost</li>\n<li>How demoing works/what judging is going to be like</li>\n<li>Helpful resources for common APIs</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>A/V check: Check the day before and again a few hours before they're needed</li>\n<li>Volunteers/judges: Check one week and one day before hand</li>\n<li>Caterers: (initial heads up about large order), one day and again a few hours before the expected meal time</li>\n<li>Scheduling: Give yourself at least an hour of margin-for-error before/after (as necessary) big tasks on the schedule. Try to give yourself some padding between meals and workshop times, give yourself more time for judging than you think you need, and know that opening/closing/anytime-you-give-other-people-the-opportunity-to-speak will take longer than you think they will.  </li>\n</ol>\n</li>\n</ul>\n<h1>Advice</h1>\n<h2>Planning</h2>\n<ul>\n<li>\n<p>Log <em>everything</em>: meeting times/durations, attendance, and most importantly a spreadsheet of all the hours contributed by each team member</p>\n<ul>\n<li>This helps establish accountability within your team; a bloated team structure is hinders overall team effectiveness and culture</li>\n<li>Promotes taking pride in your work</li>\n<li>Quantifies your effort which is incredibly useful when soliciting school admin/superior powers that for support: “Last year, our team collectively volunteered x thousand hours towards the success of our event across A, B, C, D categories.”</li>\n</ul>\n</li>\n</ul>\n<h2>Opening/Closing Ceremony</h2>\n<ul>\n<li>Open with your mission/goals for the participants over the weekend, not logistics -- something to get the participants fired up</li>\n<li>Close with logistics</li>\n</ul>\n<h2>Signage</h2>\n<p>Big, and easily identifiable\nEvent branding so they stand out from existing venue signage\nDevpost\nPost an example submission that serves as an example for what a final project should look like\nHave participants submit a placeholder submission the evening before the projects are actually due so you can gauge how many teams you’ll be dealing with, and in what categories you need assign judges\nUse the “assign table number” rather than your own system for increased compatibility\nExpo - is a great tool that unofficially accompanies Devpost (e.g. search by prize category > print the resulting page that includes assigned table numbers > distribute to judges<br>\nUtilize the devpost help resources, their dev team is super responsive on and helpful.\nUser Experience\nPrepare as many secondary events/activities as you can manage based on personnel/$ resources\nDon’t detract from the hacking purpose of the event\nWorkshops\nGreat things to do during regular meetings over the months between events\nAs hackers, you all know what you wish you knew when you first attended a hackathon\nPut together digestible workshops that help new hackers hit the ground running with a foundation in a given programming language a well as resources they can leverage going forward\nSponsors are great for providing higher level workshops\nMLH localhost!!\nSmash/ping pong tournaments\nTrivia\nBingo (sheets at every table based on hackathon achievables e.g. “submit to devpost”, “attend a workshop”,\nRaffles (big (real prize) + small (hourly, custom raffle stickers?))\nCTF puzzle hidden on website/accompanying resources/webpages\nCommunication\nSlack/Discord - event staff are identified as such in their display name, including their main role so volunteers/sponsors/participants know who to message\nClear channel purposes, yet not too many otherwise people get overwhelmed and stop checking at all - (#Announcements (locked), #General (all), #Mentors (all), (all) Memes, #Event-staff)\nJudging\nConfirm with Judges one week and one day before they need to show up to confirm numbers\nSystem: //TODO make pros/cons\nBatches of top 3 + spreadsheet\nGoogle Form\nPaper Rubric\nExample Demos\nSnag winning projects off Devpost from other hackathons if you don’t have time to prepare projects yourself, just be sure not to misrepresent it as your own\nOne being as excellent as possible, the other being average\nThis gives your judges some baseline expectations for the quality of demos they should expect\nBonus: If using an automated scoring system (E.g. Google Forms), normalize the score distribution from all the judges based off the scores they give to these two example projects that way teams don’t get penalized for harsher judges, or disproportionately advantaged by easily-impressed judges\nKeep your judging system/criteria simple: judges will only have 3-5 minutes to evaluate teams; you don’t bog them down with lots details to keep track of or a non-intuitive method of recording their scores<br>\nPrize-categories\nMake your demo-process as accessible as possible\nTradeoff between specific tracks and number of demos\nAlong with your event-specific demo categories, it’s a good idea to include catch-all categories like\nBest First Hack\t\t(Majority of team are first-time hackers),\nPeople’s Choice\t(Poll system or demo phase where people are allowed to go\nview other people’s hacks)\nBest ____ Hack //TODO I swear I had the adjective in my mind at 3:00 AM last night, but now I can’t remember what I was thinking of\nLook at other events’ Devpost’s for ideas for categories.\nSocial Media\nEnsure that hackers are ok with having their picture taken at the event via release form\nImplement a system to distinguish people who would prefer not to be included in images (can be denoted by an alternate lanyard color, etc.)\nDesignate a team member to manage social media: Live Tweet the event!\nMini-events\nWorkshops\nDemos\nAward Ceremony\nMaximize user interaction by including media in all posts - people are more likely to click on posts with gifs/pictures/videos than they are a bland, text-only Tweet/link to external site\nRemain active year-round to retain followers\nCrowdsource publicity by creating a Snapchat geofilter for the weekend\nAdditional Resources\nMLH Organizer Guide - The de facto textbook\n“Generally speaking, there are 5 things you need to organize a hackathon – a venue, food, power, wifi, and people. Getting those things right is core to having a successful event.”</p>\n<p>API Quick Links/Troubleshooting\nMLH Specific APIs\nDomain.com:\nIssue: The most common issue hackers encounter with the site is caused by higher-than-expected  frequency of domain purchases from a dense region/wifi Network.  Domain.com goes into lockdown as it looks like Credit Card fraud, and just prevents any new domain acquisitions until a ‘cooldown’ period has transpired.\nFix: Unfortunately, the only consistent fix (other than calling Domain.com support) is to wait a few hours then try again.  In order to prevent this measure, encourage hackers to register their domains earlier in the event (most still won’t).  Most teams register a domain after they’ve completed their main project to serve as a landing page, which usually happens in 3-5 hour window before project submission and creates a bottleneck.  Registering your domain first thing helps mitigate this issue.\nGoogle Cloud Platform\nSnapKit - documentation is high level, currently working on a more in–depth writeup\nBlockStack\nDocumentation page is very beginner friendly.<br>\nUser forum/Slack is super active and helpful as well\nAmazon Web Services\nGitHub\nRegister an account as a student and gain access to tons of educational resources and credit towards services including AWS, Heroku, etc.\n<a href=\"https://education.github.com/\">https://education.github.com/</a>\nGeneral Resources for Popular Subjects\nJavaScript\nDaniel Shiffman / Coding Train - p5.js tutorials on hundreds of topics\nMachine Learning\nSentdex - Extensive Python ML YouTube playlist with practical implementations of popular libraries as well as explanatory  from-scratch reproductions\n“Machine Learning for Beginners: An Introduction to Neural Network”</p>","frontmatter":{"title":"How to Run a Hackathon","date":"April 21, 2019","subtitle":"a plan, a good team, and lots of lead time!","duration":"15 minute read"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/how-to-run-a-hackathon/"}}